### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [3]:
unique_players = purchase_data['SN'].value_counts()
total_players = len(unique_players)
total_players_df = pd.DataFrame({"Total Players": [total_players]})
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
num_unique_items = purchase_data['Item Name'].nunique()
num_unique_items

179

In [6]:
avg_price = purchase_data['Price'].mean()
avg_price = round(avg_price,2)
avg_price

3.05

In [7]:
num_purchases = len(purchase_data['Purchase ID'])
num_purchases

780

In [8]:
total_revenue = purchase_data['Price'].sum()
total_revenue

2379.77

In [9]:
summary_df = pd.DataFrame({"Number of Unique Items": [num_unique_items], 
                           "Average Price": [avg_price],
                          "Number of Purchases": [num_purchases],
                            "Total Revenue": [total_revenue]})
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179           3.05                  780        2379.77

In [10]:
summary_df["Average Price"] = summary_df["Average Price"].map(
    "${0:,.2f}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases  Total Revenue
0                     179         $3.05                  780        2379.77

In [11]:
summary_df["Total Revenue"] = summary_df["Total Revenue"].map(
    "${0:,.2f}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [12]:
purchase_count = purchase_data['Gender'].groupby
purchase_count

<bound method Series.groupby of 0        Male
1        Male
2        Male
3        Male
4        Male
        ...
775    Female
776      Male
777      Male
778      Male
779      Male
Name: Gender, Length: 780, dtype: object>

In [13]:
gender_group = purchase_data.groupby(['Gender'])
gender_group.count().head()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [14]:
#Retreive value counts of "Gender" feature
sn = gender_group['SN'].nunique()
sn

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [15]:
dist_sn = sn/sn.sum()*100
dist_sn = round(dist_sn,2)
dist_sn

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [16]:
gender_demo = pd.DataFrame({"Total Count": sn,
                            "Percentage of Players": dist_sn})
gender_demo.head()

                       Total Count  Percentage of Players
Gender
Female                          81                  14.06
Male                           484                  84.03
Other / Non-Disclosed           11                   1.91

In [17]:
gender_demo["Percentage of Players"] = gender_demo["Percentage of Players"].map(
    "{0:,.2f}%".format)
gender_demo.head()

                       Total Count Percentage of Players
Gender
Female                          81                14.06%
Male                           484                84.03%
Other / Non-Disclosed           11                 1.91%

In [18]:
# Sort results in descending order
#remove "gender" column header
gender_demo = gender_demo.sort_values(["Percentage of Players"], ascending=False)
gender_demo.head()

                       Total Count Percentage of Players
Gender
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [19]:
#Retreive value counts of "Gender" feature
gender_counts = purchase_data['Gender'].value_counts()
gender_counts

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [20]:
gender_counts.sum()

780

In [21]:
avg_purchase_price = gender_group['Price'].mean()
avg_purchase_price = round(avg_purchase_price,2)
avg_purchase_price

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [22]:
total_purchase_value = gender_group['Price'].sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [23]:
#Need to work on formula
avg_total_ppp = total_purchase_value/sn
avg_total_ppp

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [24]:
gender_demo = pd.DataFrame({"Purchase Count": gender_counts,
                            "Average Purchase Price": avg_purchase_price,
                            "Total Purchase Value": total_purchase_value,
                           "Avg Total Purchase per Person": avg_total_ppp})
gender_demo.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,3.20,361.94,4.468395
Male,652,3.02,1967.64,4.065372
Other / Non-Disclosed,15,3.35,50.19,4.562727

In [25]:
gender_demo["Average Purchase Price"] = gender_demo["Average Purchase Price"].map(
    "${0:,.2f}".format)
gender_demo.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.20,361.94,4.468395
Male,652,$3.02,1967.64,4.065372
Other / Non-Disclosed,15,$3.35,50.19,4.562727

In [26]:
gender_demo["Total Purchase Value"] = gender_demo["Total Purchase Value"].map(
    "${0:,.2f}".format)
gender_demo.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.20,$361.94,4.468395
Male,652,$3.02,"$1,967.64",4.065372
Other / Non-Disclosed,15,$3.35,$50.19,4.562727

In [27]:
gender_demo["Avg Total Purchase per Person"] = gender_demo["Avg Total Purchase per Person"].map(
    "${0:,.2f}".format)
gender_demo.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [28]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [29]:
players = purchase_data['SN'].nunique()
players

576

In [30]:
ages = purchase_data['SN'].value_counts()
ages.sort_index(ascending=True)

Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: SN, Length: 576, dtype: int64

In [31]:
ages_sum = ages.sum()

In [34]:
ages_sum

780

In [44]:
bins = [0,9.9,14.9,19.9,24.9,29.9,34.9,39.9,45.9]
bin_names = ['<10','10-14','15-19','20-24','25-29',
             '30-34','35-39','40+']
bin_purchase_data = purchase_data[''] = pd.cut(purchase_data['Age'],
                           bins, labels=bin_names,
                           include_lowest=True)

bin_purchase_data = bin_purchase_data.value_counts()
bin_purchase_data
# bin_values = purchase_data[''].value_counts()
# bin_values

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       13
Name: Age, dtype: int64

In [46]:
pop = bin_purchase_data/ages_sum*100
pop = round(pop,2)
pop

20-24    46.79
15-19    17.44
25-29    12.95
30-34     9.36
35-39     5.26
10-14     3.59
<10       2.95
40+       1.67
Name: Age, dtype: float64

In [47]:
age_demo = pd.DataFrame({"Total Count": bin_purchase_data,
                            "Percentage of Players": pop})
age_demo = age_demo.head(9).sort_index(ascending=True)
age_demo

       Total Count  Percentage of Players
<10             23                   2.95
10-14           28                   3.59
15-19          136                  17.44
20-24          365                  46.79
25-29          101                  12.95
30-34           73                   9.36
35-39           41                   5.26
40+             13                   1.67

In [48]:
age_demo["Percentage of Players"] = age_demo["Percentage of Players"].map("{0:,.2f}%".format)
age_demo.head(9)

       Total Count Percentage of Players
<10             23                 2.95%
10-14           28                 3.59%
15-19          136                17.44%
20-24          365                46.79%
25-29          101                12.95%
30-34           73                 9.36%
35-39           41                 5.26%
40+             13                 1.67%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame